Revit 2026 API

# ElementMulticlassFilter(IListType) Constructor

---

Initializes a new instance of the ElementMulticlassFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementMulticlassFilter(
	IList<Type> typeList
)
```
```vb
Public Sub New (
	typeList As IList(Of Type)
)
```
```cpp
public:
ElementMulticlassFilter(
	IList<Type^>^ typeList
)
```
```fsharp
new :
        typeList : IList<Type> -> ElementMulticlassFilter
```

#### Parameters

typeList IListType

#### Reference

ElementMulticlassFilter Class

ElementMulticlassFilter Overload

Autodesk.Revit.DB Namespace